import {OutPutData} from "./OutPutData";
import OutPutCard from "./OutPutCard";

export function JianXing() {
    const data: OutPutData = {
        name: "剑星",
        mainPic: "https://file.plat.intmian.com/uploads/2025/11/11/fjy/5709a4fa-fcce-4aba-bbf6-67642741c615/image.png",
        note: "2024 韩国",
        objScore: {
            value: 4, plus: false, sub: false, comment:
                "制作精良的动作游戏。\n" +
                "人物、动作与建模极为出众。场景、音乐、Gameplay与关卡也很用心。"
        },
        subScore: {
            value: 4, plus: false, sub: false, comment:
                "人物建模服装和动作带来的愉悦感就不用多说了。\n" +
                "难度曲线和系统设计得很合理，就算是手残玩家也能玩得很开心。\n" +
                "剧情也很抓人，时不时会带来那种恰到好处的惊喜。" +
                "演出效果特别棒，足够调动老玩家的情绪。\n" +
                "本来我想给到四分加，但可惜卢瓦高层和底层这两张任务真的是太吓人了，所以只能扣半分。"
        },
        innovateScore: {
            value: 4, plus: false, sub: true, comment:
                "能看到很多业界里已经很成熟的设计，还有最近几年一些知名游戏的影子，特别是魂类游戏和《尼尔：机械纪元》的影响挺明显的。玩法上给人一种“既要又要”的感觉吧，但它却很巧妙地把这些看似乱七八糟的玩法塞进了一个大的框架里，让你玩起来不仅不觉得杂乱，反而有种很有机、很协调的体验。\n" +
                "这算是韩国3A游戏的第一步，也是我第一次在三A大作里看到这种很明显的韩式审美。当然，通过合理的换装和调整发型，还是能符合我们中国玩家的审美的。不得不说，中、日、韩的审美其实都挺接近，也比较让人放心。"
        },
        mainScore: {
            value: 4, plus: false, sub: false, comment:
                "整体表现出色，是一款值得推荐的游戏"
        },
        comment:
            "大概在去年，就经常能看到大家把《黑神话：悟空》和韩国的首款3A大作《剑星》拿来比较。一开始我还以为这就是个靠女主角好看当主要卖点的游戏，尤其它和《黑神话悟空》发布时间比较接近，网上很多人也在攻击它，所以那时候我对它的印象挺一般的。  \n" +
            "到了今年，前段时间因为工作特别忙，心情也很郁闷。虽然游戏打折我就入手了。但当时一边忙工作，一边在打《三角洲行动》，只是浅尝辄止，玩得挺急功近利的，也没真正感受到它的好玩之处就搁置了。  \n" +
            "最近因为跳槽，中间有个短暂的 gap 期，终于能抽出一整段时间来玩。不得不说，大型3A游戏真的是需要一个能从早玩到晚、完全沉浸的时间，这次我是真的 get 到了它的魅力。  \n" +
            "首先，很多人最关心的角色设计，我觉得没什么特别值得挑刺的地方。除了韩国一贯的那种喜欢塑造粗大腿的审美有点奇怪，但通过合理搭配衣服、调整发型，加一些饰品，还是能很好地掩盖这个问题。尤其装备在游戏里是“看不见”的变化，看得见的服装和外观都能单独更换，这点特别重要。  \n" +
            "其次，场景设计、动作以及过场动画都非常不错，甚至很有感染力。而且不像有些游戏因为预算或设计缩水，后期出现虎头蛇尾的情况，相反它最后几个场景和地图的设计还是挺出彩的。虽然没有虚幻引擎那种极致细腻和恢弘的建模。但优化很到位，以我 4070TiS 全高画质 + 4K + 无DLSS，没有任何场景会卡顿低于60帧，优化很到位。  \n" +
            "玩法上有点像白金工作室的几款作品和最近大家都喜欢借鉴的《只狼》的结合体，但它不会让某个系统过于繁杂、信息量巨大到让人学不来，反而流程很顺，操作压力也不大，打击感也很棒。尤其是击败特定 Boss 时的特写和动画，帅到不行。像我不太喜欢的迷宫和解谜，在这里也只是浅尝辄止，如果卡关时间太长，它会给提示，而且地图设计有明显引导。一本道地图加上扫描器这种能标注重点位置的“神器”，让你基本不可能迷路。  \n" +
            "人过了20岁可能确实游戏能力会下降，我也不得不接受自己只能用低难度通关的事实。但它和很多游戏不一样，低难度的曲线设计很合理，只是增加了容错，不会影响乐趣，甚至让我这种不爱反复挑战、背 Boss 招式的玩家获得了更好体验。毕竟它主线不是 Boss Rush，而是目标之间的探索，这点我很喜欢。当然，前期几张地图有点像“通马桶任务”——A门需要你找钥匙，钥匙又在B门，B门又要收集各种材料——有点烦，但后面就好多了。  \n" +
            "美中不足的是卢瓦的高层和低层地图，真是过于阴间了。我很讨厌这种阴森、逼仄的氛围，压迫感重，让人心里很焦躁，没有从容掌控的感觉。尤其还喜欢在奇怪的地方安排怪物突然跳出来吓人。我玩到第二章地图的时候试着关掉声音，结果一下就没什么吓人的感觉了……  \n" +
            "不确定这是本来就这么设计，还是特地考虑了中国玩家。我用中文模式玩的时候，书上的字、建筑的标牌、路标几乎都是中文，只有少数地方保留点英文通用写法，完全没有什么韩国文化传统的特定符号或韩文，也不存在外国玩家看不懂的前置设定。这点我觉得特别好，这样我在几百公里外的杭州也能完全无障碍地感受到一个韩国游戏的魅力。  \n" +
            "至于 DLC 和钓鱼系统，我就懒得吐槽了,重复内容很多，这是我唯一一次用修改器跳过冗长收集流程的地方。dlc也不太有诚意\n" +
            "剧情方面很有趣，也能看出受《尼尔：机械纪元》一些影响，但它写得挺好，设定新颖，故事宏大且神奇。虽然有些情节我可能提前猜到了，但真到剧情揭秘的时候还是很惊喜。不过它在任务界面应该更详细地说明“我为什么要做这件事”，否则像我这种玩到一半搁置，过很久再回来的，就会忘记自己为什么要收集超能电池或者阿尔法核心。还有一点不足是，完美结局解锁条件不看攻略几乎不可能知道，很容易忽视支线的影响，导致后期无可挽回，有点挫败。  \n" +
            "人物刻画也不错，角色都有始有终，在揭开阴谋的过程中不断成长，但不会改变本质。比如主角，就是一个意志极其坚定的战士，不会像某些小女孩主角那样因为恐惧而退缩，她为了目标牺牲生命也毫不犹豫。  \n" +
            "总的来说，《剑星》是一款制作精良、玩法丰富且剧情引人入胜的动作游戏。虽然是韩国的作品可能引发一些人的不信任，但是我觉得这其实是最为理想形态的日式3a：）。虽然有一些小瑕疵，但整体体验非常出色，值得推荐给喜欢动作游戏和科幻题材的玩家们。"
    };

    return <OutPutCard data={data} editable={false}/>;
}